Revit 2027 API
ParameterUtils.DownloadCompanyName(Document, ForgeTypeId, String) Method
 Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string DownloadCompanyName(
	Document document,
	ForgeTypeId parameterTypeId,
	string region
)
Public Shared Function DownloadCompanyName (
	document As Document,
	parameterTypeId As ForgeTypeId,
	region As String
) As String
public:
static String^ DownloadCompanyName(
	Document^ document,
	ForgeTypeId^ parameterTypeId,
	String^ region
)
static member DownloadCompanyName :
        document : Document *
        parameterTypeId : ForgeTypeId *
        region : string -> string
Parameters
document Document
 Document in which to record the name of the parameter's owning account.
parameterTypeId ForgeTypeId
 Parameter identifier.
region String
 Region of the account where the parameter is defined.
Return Value
String
 Name of the owning account.
Exceptions
Exception | Condition
AccessDeniedException |  Thrown when the user is not authorized to access the requested information.
ArgumentException |  The region is not valid. -or- Thrown when the parameter identifier does not include an account identifier.
ArgumentNullException |  A non-optional argument was null
[!:Autodesk::Revit::Exceptions::NetworkCommunicationError] |  Thrown when communication with the remote service is unsuccessful.
ResourceNotFoundException |  Thrown when the requested information is not found.
ServerInternalException |  Thrown when the remote service reports an internal error.
UnauthenticatedException |  Thrown when the user is not signed in.
Remarks
 In Revit, the account name appears in the parameter tooltip if available.
See Also
Reference
ParameterUtils Class
DownloadCompanyName Overload
Autodesk.Revit.DB Namespace